Tekla Open API Reference for Tekla Structures 2025
RebarEndDetailModifier.RebarLengthAdjustment Property
 Gets or sets the reinforcing bar length adjustment data.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarLengthAdjustmentDataNullable RebarLengthAdjustment { get; set; }
Public Property RebarLengthAdjustment As RebarLengthAdjustmentDataNullable
	Get
	Set
Property Value
Type: RebarLengthAdjustmentDataNullable
See Also
Reference
RebarEndDetailModifier Class
Tekla.Structures.Model Namespace